<script lang="ts">
	const directors = [
		{
			name: 'Никульшин Михаил Иванович',
			years: '16.06.1966 – 1967гг.',
			img: 'nikul.jpg',
			text: 'Врач акушер гинеколог высшей категории, Отличник курортов профсоюзов'
		},
		{
			name: 'Сычев Александр Васильевич',
			years: '02.09.1967 - 09.01.1973гг, 21.03.1977 – 03.05.1982гг.',
			img: '',
			text: 'Отличник здравоохранения, заслуженный врач Башкирский АССР.'
		},
		{
			name: 'Максимов Евгений Иванович',
			years: '10.01.1973 – 09.07.1975гг.',
			img: 'maxim.jpg',
			text: ''
		},
		{
			name: 'Баимбетов Лябиб Габдуллович',
			years: '07.1975 – 20.03.1977гг.',
			img: 'baimb.jpg',
			text: 'Кандидат медицинских наук'
		},
		{
			name: 'Марданов Кадим Хасанович',
			years: '24.04.1982 – 1990гг.',
			img: '',
			text: 'Заслуженный врач РСФСР'
		},
		{
			name: 'Исхаков Рим Мирасович',
			years: '1990 – 2001гг.',
			img: '',
			text: 'Заслуженный врач России'
		},
		{
			name: 'Ахмадуллин Роберт Вафич',
			years: '02.2001 – 07.2006гг.',
			img: '',
			text: 'Заслуженный врач РБ, кандидат медицинских наук, отличник здравоохранения по курортологии'
		},
		{
			name: 'Аюпов Ильдус Мусинович',
			years: '2006 - 07.2011гг.',
			img: 'aupov.jpg',
			text: 'Заслуженный врач РБ, кандидат медицинских наук, врач высшей категории'
		},
		{
			name: 'Валиуллин Динар Рахимьянович',
			years: '2011-2012гг.',
			img: 'valiul.jpg',
			text: 'Кандидат медицинских наук'
		},
		{
			name: 'Бадретдинов Рамиль Рафаилович',
			years: '2012 – 2014гг.',
			img: 'badret.jpg',
			text: 'Заслуженный работник здравоохранения Российской Федерации, Заслуженный врач Республики Башкортостан Доктор медицинских наук'
		},
		{
			name: 'Салахов Энвир Масабихович',
			years: '2014 – 2017гг.',
			img: 'salah.jpg',
			text: 'Заслуженный врач РФ и РБ, отличник здравоохранения'
		},
		{
			name: 'Байтеряков Фиял Рифович',
			years: '2017 – 2019гг.',
			img: 'baiter.jpg',
			text: 'Депутат Курултай собрания'
		},
		{
			name: 'Абдуллин Мансур Рашитович',
			years: '2019 – 2020гг.',
			img: 'abdulin.jpg',
			text: ''
		},
		{
			name: 'Байтеряков Фиял Рифович',
			years: '2020 – н.д.',
			img: 'baiter.jpg',
			text: 'Депутат Курултай собрания'
		}
	];
</script>

<svelte:head>
	<title>История | Санаторий «Зеленая роща»</title>
</svelte:head>

<section class="container p-4 mx-auto max-w-screen-2xl mt-28">
	<div class="flex flex-col text-center w-full mb-10">
		<h1 class="sm:text-4xl text-3xl font-bold font-condensed mb-4 text-gray-900">История</h1>
		<!-- <p class="lg:w-2/3 mx-auto leading-relaxed text-base">
            Banh mi cornhole echo park skateboard authentic crucifix neutra
            tilde lyft biodiesel artisan direct trade mumblecore 3 wolf moon
            twee
        </p> -->
	</div>
	<div class="lg:w-4/6 mx-auto mb-12">
		<h2 class="text-2xl mb-8 text-center">История развития санатория «Зеленая роща»</h2>
		<div class="text-lg">
			<p class="mb-6">
				До 1917 года местность современного санатория «Зеленая Роща» носила название «Дачное», и в
				лесном массиве располагалось много одноэтажных домиков.
			</p>

			<p class="mb-6">
				После октябрьской революции в 1918 году был опубликован Декрет Совета народных комиссаров «О
				лечебных местностях общегосударственного значения», это дачное место со всеми постройками
				было передано профсоюзной организации Уфимских железнодорожных мастерских для открытия дома
				отдыха. Так начал работать первый профсоюзный Дом отдыха для трудящихся Башкирии.
			</p>

			<p class="mb-6">
				В годы Великой отечественной войны 1941-1945 в доме отдыха был развернут эвакогоспиталь
				4018. После победы над фашистской Германией Уфимский дом отдыха вновь открыл свои двери для
				трудящихся.
			</p>

			<p class="mb-6">
				В начале 1960-х годов началось строительство 3-5 этажных спальных корпусов, лечебного
				корпуса, столовой, и в 1966 году дом отдыха «Уфимский» стал санаторием «Зеленая Роща».
			</p>

			<p class="mb-6">
				За прошедшие 50 лет санаторий стал крупной многопрофильной базовой здравницей Республики
				Башкортостан. Этот современный лечебно-оздоровительный комплекс, размещенный на 27 гектарах
				и способный разместить 700 отдыхающих, представлен 5 отделениями, оказывающими
				лечебно-консультативную помощь по 30 специальностям. С 2006 года действует Центр красоты и
				здоровья, осуществляющий широкий ряд классических и самых современных косметологических
				процедур на современном оборудовании.
			</p>

			<p class="mb-6">
				С 2006 по 2018 года постоянно обновляется номерной фонд, усовершенствуется лечебная база,
				досуг, ведется работа по благоустройству территории. На территории санатория работают в
				зимнее время (каток, лыжня, тюбинг) в летнее время (прокат велосипедов, терренкур, волейбол,
				игра в городки)
			</p>

			<p class="mb-6">
				В 2009 году проведена реконструкция главной аллеи санатория – появились новые клумбы,
				изменилась форма аллеи, выложены дорожки.
			</p>

			<p class="mb-6">
				В 2011 году танцевальный зал приобрел современный вид: проведена полная реконструкция,
				изменилась форма, зал оснащен современной световой и звуковой аппаратурой, тут же расположен
				бар и зона уединения.
			</p>

			<p class="mb-6">
				За время работы в санатории разработаны методики лечения различных заболеваний:
				кардиореабилитация, нейрореабилитация, органов пищеварения, органов дыхания, костно-мышечной
				системы, нервной системы, болезней эндокринной системы, расстройства питания и нарушения
				обмена веществ, системы кровообращения, мочеполовой системы, гинекологических, кожи.
			</p>

			<p class="mb-6">
				Санаторий «Зеленая роща» - многопрофильная здравница с отличной лечебной и диагностической
				базой. Единый комплекс, лечебное сбалансированное питание, уникальные природные источники
				маломинерализованная сульфатно-кальциевая вода «Хызыр» и сероводородный источник,
				многопрофильное лечение, комфортные номера, прекрасно организованный досуг – главные
				преимущества санатория «Зеленая роща». Коллектив работает под лозунгом
				<span class="italic font-serif font-semibold text-lg">«Сохраним здоровье вместе».</span>
			</p>
		</div>
	</div>

	<div
		class="my-12 grid auto-rows-fr grid-cols-1 md:grid-cols-2 lg:grid-cols-3 xl:grid-cols-4 gap-4"
	>
		{#each new Array(24) as photo, i}
			<div class="h-full">
				<img
					src={`https://files.green-kurort.ru/green_rosha/history/img${i}.jpg`}
					alt={String(i)}
					class="h-56 w-full object-cover rounded-lg"
				/>
			</div>
		{/each}
	</div>

	<div class="my-12">
		<h2 class="text-2xl mb-8 text-center font-bold font-condensed">Руководители Санатория</h2>
		<div
			class="grid grid-cols-1 auto-rows-auto md:grid-cols-2 lg:grid-cols-3 xl:grid-cols-4 gap-6 md:gap-8 lg:gap-10 xl:gap-12"
		>
			{#each directors as director, idx}
				<div class="card w-full bg-white shadow-xl">
					<figure>
						<img
							src={director.img
								? `https://files.green-kurort.ru/green_rosha/directors/${director.img}`
								: '/logo-192.png'}
							alt={director.name}
							class="h-80 w-full object-cover object-top"
						/>
					</figure>
					<div class="card-body">
						<div>
							<h2 class="card-title">{director.name}</h2>
							<p class="mb-5">{director.years}</p>
						</div>
						<p>{director.text}</p>
					</div>
				</div>
			{/each}
		</div>
	</div>
</section>
